Catalogs/МЛК_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МЛК_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКабинетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтклонено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗакрыто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьФамилию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШаблонаСМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортЛицевыеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортСчетчики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортПлатежи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортКвитанции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКвитанции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВариантыСчетовИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортПоказанияСчетчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичнаяСинхронизацияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичнойСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьИнтеграцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправленоВУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПоОплатам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МЛК_Комиссия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПоЛицевымСчетам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейСинхронизацииПоСчетчикам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузкиПоНачислениям</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузкиПоОплатам</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплатыОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФоновыеЗадания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МЛК_Настройки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТестСоединения(Команда)
	ТестСоединенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестСоединенияНаСервере()
	
	// 1. Сначала проверим, есть ли интернет соединение
	
	ЗапросБезКодировки = "";
	СтрокаОписанияОшибки = "";
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресКабинетов);
	АдресРесурса = "/api/v4/applications/"+Строка(СокрЛП(Объект.НомерПриложения));
	
	ЗапросБезКодировки = ЗапросБезКодировки + Строка(АдресСервисаСтр) + Строка(АдресРесурса);
	
	СтрокаПараметров = "";
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса + СтрокаПараметров);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 30, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ЕстьОтвет = Ложь;
		Сообщить("Тест соединения. Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Если Ответ.КодСостояния = 200 Тогда
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Ложь, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					Сообщить("Соединение установлено с "+Строка(ЗагруженныеДанные.ShortDescription));
				КонецЕсли;
			КонецЕсли;
			
			
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
			СтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
			СтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
			СтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		Иначе
			Сообщить("Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
			СтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
		КонецЕсли;
		
		// Запишем в журнал результат
		ИмяСобытияВЖурнал = "Проверка соединения с МЛК и создание статусов";
		КодСостояния = Ответ.КодСостояния;
		СтрокаОтвета = СтрокаОтвет;	
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЗапросБезКодировки,СтрокаОтвета,СтрокаОписанияОшибки,ТекущаяДатаСеанса());	
	Иначе	
		
	КонецЕсли;
	
	// Теперь заполним данные о статусах обращений
	ПодгрузитьСтатусы();
	
КонецПроцедуры

&НаСервере
Процедура ПодгрузитьСтатусы()
	// вместо objects или events пиши statuses. например api/v2/statuses
	
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Объект.АдресКабинетов);
	АдресРесурса = "/api/v4/statuses?ApplicationId="+Объект.НомерПриложения;

	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Объект.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 30, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
		ЕстьОтвет = Ложь;
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					ТЗ = РаспарситьСтатусы1(ЗагруженныеДанные);
					
					Для Каждого СтрСтатус Из ТЗ Цикл
						Если Найти(нрег(СтрСтатус.Статус),"закрыт")<>0 или  Найти(нрег(СтрСтатус.Статус),"выполнено")<>0 Тогда
							Объект.СтатусЗакрыто = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"отклонен")<>0 Тогда
							Объект.СтатусОтклонено = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"обработан")<>0 Тогда
							Объект.СтатусОбработано = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"работе")<>0 Тогда
							Объект.СтатусВРаботе = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"отправлено в ук")<>0 Тогда
							Объект.СтатусОтправленоВУК = СтрСтатус.Ид_Статуса;
							
						КонецЕсли;	
						
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ответ.КодСостояния = 500 Тогда
			Сообщить("Обновление статусов. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			Сообщить("Обновление статусов. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
		ИначеЕсли Ответ.КодСостояния = 301 Тогда
			Сообщить("Обновление статусов. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
		Иначе
			Сообщить("Обновление статусов. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция РаспарситьСтатусы1(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_Статуса");
	
	Для Каждого стр из Данные Цикл
		
		Нов = ТЗ.Добавить();
		
		Нов.Статус            = Стр["Name"];
		Нов.ИД_Статуса    = Стр["id"];       // ИД события по которому будем менять статус
		Нов.ИД_Статуса    = СтрЗаменить(СокрЛП(Нов.ИД_Статуса),Символы.НПП,"");
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции

&НаСервере
Функция ЗапуститьРаботуССистемойНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Комиссия) Тогда
		Сообщить("Заполните способ комиссии");
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		Сообщить("Заполните расчетный счет");
		Возврат Ложь;
	КонецЕсли;
	
	// Состояние("Запущен процесс создания приложения, немного подождите ....");
	// Сначала нужно создать все справочники
	
	
	ПриложениеСоздано = ОтправитьЗапросЗаСозданиеПриложения(Объект.Организация);
	
	Если ПриложениеСоздано Тогда
		
		ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПервичнаяСинхронизация");
		Сообщить("Запущена первичная синхронизация, перезапустите 1с.");
		Элементы.ЗапуститьРаботуССистемой.Доступность=Ложь;
		
		Возврат Истина;
	Иначе
		Сообщить("При создании приложения возникли ошибки. Повторите попытку создания позже");
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ЗапуститьРаботуССистемой(Команда)
	
	ОткрытьФорму("Справочник.МЛК_Настройки.Форма.ПользовательскоеСоглашение",,,,,,Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат =  "Нет" Или Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Состояние("Запущен процесс создания приложения, подождите пару минут",);
	Создано = ЗапуститьРаботуССистемойНаСервере();
	Если Создано Тогда
		
		Обработчик = Новый ОписаниеОповещения("ПерезапуститьПрограмму", ЭтотОбъект);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Перезапустить", НСтр("ru = 'Перезапустить'"));
		Кнопки.Добавить("НеПерезапускать", НСтр("ru = 'Не перезапускать'"));
		ТекстВопроса = НСтр("ru = 'Для применения изменений требуется перезапустить программу.'");
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьПрограмму(Ответ, ПараметрыВыполнения) Экспорт
	Если Ответ = "Перезапустить" Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ЗначениеЗаполнено(Объект.АдресКабинетов) Тогда
		Элементы.ЗапуститьРаботуССистемой.Доступность=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

// // // // // // // // // // // // // // КОПИРОВАНИЕ И СОЗДАНИЕ ТЕНАНТА// // // // // // // // // // // // // // // 
&НаСервере
Функция ОтправитьЗапросЗаСозданиеПриложения(Организация)
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	// Журнал
	
	//  Вставить содержимое обработчика.
	АдресСервисаСтр = "mobsted-admin.moe-zkx.ru";
	// АдресСервисаСтр = "mobsted.mobsted.ru";
	Соединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 30, Новый ЗащищенноеСоединениеOpenSSL);
	Запрос        = Новый HTTPЗапрос("/api/v8/auth?login=admin@mobsted.com&password=21e7d7d567b6f3f23e3a3018b1b2b48d");
	
	ЖурналЗапросБезКодировки   = Строка(АдресСервисаСтр)+Строка("/api/v8/auth?login=admin@mobsted.com&password=21e7d7d567b6f3f23e3a3018b1b2b48d");
	
	
	Результат    = Соединение.Получить(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		ИмяСобытияВЖурнал = "Получение ключа для клонирования";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	КонецЕсли; 
	
	РезультатПроверки    = Результат.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
	ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	//  в теле результата запроса - json
	Ключ = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого стр из ЗагруженныеДанные Цикл
		Если СокрЛП(стр.Ключ)= "access_token" Тогда
			Ключ            = Стр.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		// Журнал
		ИмяСобытияВЖурнал = "Получение ключа для клонирования";
		КодСостояния = Результат.КодСостояния;
		СтрокаОтвета = Результат.ПолучитьТелоКакСтроку();;	
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	Иначе

	КонецЕсли;
	
	// // // // // // // // // // // // // // /Получили токен теперь клонируем
	
	// Журнал
	ЖурналЗапросБезКодировки   = "";
	ЖурналСтрокаОписанияОшибки = "";
	ЖурналВремяНачало          = ТекущаяДатаСеанса();
	// Журнал
	
	АдресСервисаСтр = "mobsted-admin.moe-zkx.ru";
	// АдресСервисаСтр = "mobsted.mobsted.ru";

	АдресРесурса1 = "/api/v8/tenants/clone";
	
	ИДОрганизации = "";
	ОргСведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДатаСеанса(), Неопределено);
	ИДОрганизации = СтрЗаменить(ИДОрганизации,"-","");	
	ТелефонОрганизации = УбратьНенужныеСимволы(ОргСведения.ТелОрганизации);
	
	Если Не ЗначениеЗаполнено(ОргСведения.АдресЭлектроннойПочтыОрганизации) Тогда
		Сообщить("Обязательно заполните электронную почту Вашей организации в справочнике");
		Возврат Ложь;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(ТелефонОрганизации) Тогда
		Сообщить("Обязательно заполните телефон Вашей организации в справочнике");
		Возврат Ложь;
	КонецЕсли;	
	
	ЖурналЗапросБезКодировки = Строка(АдресСервисаСтр)+СТрока(АдресРесурса1)+"tenantname=b"+Строка(ОргСведения.ИННЮЛ)
	+"&email="+Строка(ОргСведения.АдресЭлектроннойПочтыОрганизации)+"&phone="+Строка(ТелефонОрганизации);
	
	СтрокаПараметров     = "tenantname=b"+Строка(КодироватьСтроку(ОргСведения.ИННЮЛ,СпособКодированияСтроки.КодировкаURL))
	+"&email="+Строка(КодироватьСтроку(ОргСведения.АдресЭлектроннойПочтыОрганизации,СпособКодированияСтроки.КодировкаURL))
	+"&phone="+Строка(КодироватьСтроку(ТелефонОрганизации,СпособКодированияСтроки.КодировкаURL));
	
	
	
	ПараметрыКонфиг = 
	"{"
	+"""smsc"""         +":" 
	+"{"
	+"""https"""                  +":"+ """0"""+","
	+"""debug"""                  +":"+ """0"""+","
	+"""post"""                   +":"+ """0"""+","
	+"""login"""                  +":"+ """mobsted"""+","
	+"""password"""               +":"+ """gbltw"""+","
	+"""from"""                   +":"+ """api123@smsc.ru"""+","
	+"""charset"""                +":"+ """utf-8"""+","
	+"""status"""                 +":"+ """on"""
	+"}"
	+"}";
	
	ЖурналЗапросБезКодировки = ЖурналЗапросБезКодировки + "&config=" +Строка(ПараметрыКонфиг);
	
	ПараметрыКонфиг     = КодироватьСтроку(ПараметрыКонфиг,СпособКодированияСтроки.КодировкаURL);
	СтрокаПараметров = СтрокаПараметров + "&config=" + ПараметрыКонфиг;
	
	НазваниеОрганизации = Строка(ОргСведения.НаимЮЛСокр);
	НазваниеОрганизации = СтрЗаменить(НазваниеОрганизации,"""","\""");
	ИНН = Строка(ОргСведения.ИННЮЛ);
	КПП = Строка(ОргСведения.КППЮЛ);
	
	ПараметрыОрганизации = 
	"{"
	+"""organisation"""         +":"+ """"+НазваниеОрганизации+""""+","
	+"""inn"""                  +":"+ """"+ИНН+""""+","
	+"""kpp"""                  +":"+ """"+КПП+""""
	+"}";
	
	ЖурналЗапросБезКодировки = ЖурналЗапросБезКодировки + "&params=" + ПараметрыОрганизации;
	
	ПараметрыОрганизации     = КодироватьСтроку(ПараметрыОрганизации,СпособКодированияСтроки.КодировкаURL);
	СтрокаПараметров = СтрокаПараметров + "&params=" + ПараметрыОрганизации;
	
	СтрокаПараметров = СтрокаПараметров + "&source_tenantname="+Строка("testbit");
	
	ЖурналЗапросБезКодировки = ЖурналЗапросБезКодировки + "&source_tenantname="+Строка("testbit");
	
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");  
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Bearer "+Строка(Ключ));  
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 30, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если Ответ.КодСостояния = 200 Тогда
		СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		Если Не ПустаяСтрока(СтрокаОтвет) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаОтвет);
			ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
			ЧтениеJSON.Закрыть();
			
			СоздатьНастройкиОрганизации(ЗагруженныеДанные,Организация);
			
			РезультатПроверки = СтрокаОтвет;
			Результат = РезультатПроверки;
			// Сообщить(Результат);
		КонецЕсли;
	Иначе
		ЖурналСтрокаОписанияОшибки = ОписаниеОшибки();
		// Журнал
		ИмяСобытияВЖурнал = "Клонирование тенанта";
		КодСостояния = Ответ.КодСостояния;
		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();;
		Если Найти(СтрокаОтвета,"We found that DB is exist. Please, set another tenantname.") Тогда
			Сообщить("Приложение зарегистрированное на ИНН: "+СТрока(Объект.Организация.ИНН)+" уже существует. Обратитесь к разработчикам");
		КонецЕсли;	
		МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало);	
		Возврат Ложь;	
	КонецЕсли;
	
	// // Журнал
	// ИмяСобытияВЖурнал = "Клонирование тенанта";
	// КодСостояния = Ответ.КодСостояния;
	// СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();;	
	// МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало,ТекущаяДатаСеанса(),Неопределено);	
	Возврат Истина;
КонецФункции

&НаСервере
Функция УбратьНенужныеСимволы(Элемент, Символ="")
	Перем Результат;
	Результат=Строка(Элемент);
	
	Результат = СтрЗаменить(Результат,Символы.Нпп,Символ);
	Результат = СтрЗаменить(Результат,"/",Символ);
	Результат = СтрЗаменить(Результат,"\",Символ);
	Результат = СтрЗаменить(Результат,".",Символ);
	Результат = СтрЗаменить(Результат,",",Символ);
	// Результат = СтрЗаменить(Результат,"+",Символ);
	Результат = СтрЗаменить(Результат,"-",Символ);
	Результат = СтрЗаменить(Результат,"!",Символ);
	Результат = СтрЗаменить(Результат,"@",Символ);
	Результат = СтрЗаменить(Результат,"#",Символ); 
	Результат = СтрЗаменить(Результат,"$",Символ);
	Результат = СтрЗаменить(Результат,"%",Символ);
	Результат = СтрЗаменить(Результат,"^",Символ);
	Результат = СтрЗаменить(Результат,"&",Символ);
	Результат = СтрЗаменить(Результат,"*",Символ);
	Результат = СтрЗаменить(Результат,"(",Символ);
	Результат = СтрЗаменить(Результат,")",Символ);
	Результат = СтрЗаменить(Результат,"№",Символ);
	Результат = СтрЗаменить(Результат,";",Символ);
	Результат = СтрЗаменить(Результат,":",Символ);
	Результат = СтрЗаменить(Результат,"?",Символ);
	Результат = СтрЗаменить(Результат," ",Символ);
	Возврат Результат;
	ТекНомерТелефона="";счетчик=0;ПервоеВхождение=ложь;
	Для Индекс = 1 По СтрДлина(Результат) Цикл
		Символ = Сред(Результат, Индекс, 1); 
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда //  Код нуля - 48, код 9-ки - 57
			// ТекНомерТелефона = ТекНомерТелефона + Символ;
			Если Символ="9" и ПервоеВхождение=ложь Тогда
				ПервоеВхождение=Истина;
				
			КонецЕсли;
			Если ПервоеВхождение  Тогда
				ТекНомерТелефона = ТекНомерТелефона + Символ;
				Счетчик=Счетчик+1;
			КонецЕсли;
			Если Счетчик=10 Тогда
				ТекНомерТелефона="+7"+ТекНомерТелефона;
				Возврат ТекНомерТелефона;
			КонецЕсли;
			
		ИначеЕсли СтрДлина(ТекНомерТелефона) > 0 Тогда
			// ТекНомерТелефона = "";
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура СоздатьНастройкиОрганизации(ЗагруженныеДанные,Организация);
	
	tenantname = ЗагруженныеДанные["data"][0]["attributes"]["tenantname"];
	servername = ЗагруженныеДанные["data"][0]["attributes"]["servername"];
	url        = ЗагруженныеДанные["data"][0]["attributes"]["url"];
	url        = СтрЗаменить(url,"https://","");
	key1       = ЗагруженныеДанные["data"][0]["attributes"]["api"]["key1"];
	key2       = ЗагруженныеДанные["data"][0]["attributes"]["api"]["key2"];
	
	Логин      = ЗагруженныеДанные["data"][0]["attributes"]["authentication"]["email"];
	Пароль     = ЗагруженныеДанные["data"][0]["attributes"]["authentication"]["password"];
	
	ДанныеДляПарсера = Строка(key1)+":"+Строка(key2); // КодироватьСтроку(
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла,"CESU-8");
	ЗаписьТекста.Записать(ДанныеДляПарсера);
	ЗаписьТекста.Закрыть();
	
	СтрокаТокен = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Токен = Base64Строка(СтрокаТокен);
	Токен = СтрЗаменить(Токен,"¶","");
	Токен = СтрЗаменить(Токен,Символ(10),"");
	Токен = СтрЗаменить(Токен,Символ(13),"");
	УдалитьФайлы(ИмяВременногоФайла);
	
	Нов = Объект;
	Нов.АдресКабинетов                   = url;
	Нов.НомерПриложения                  = 717;
	Нов.Токен                            = Токен;
	Нов.Логин                            = Логин;
	Нов.Пароль                           = Пароль;
	
	Записать();
	
	Константы.МЛК_ИспользоватьИнтеграциюСМобильнымиЛичнымиКабинетами.Установить(Истина);
	
	// потом нужно получить и записать СТАТУСЫ
	ЕстьОтвет = Истина;
	
	АдресСервисаСтр = СокрЛП(Нов.АдресКабинетов);
	АдресРесурса = "/api/v4/statuses?ApplicationId="+Нов.НомерПриложения;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Нов.Токен));
	HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , 30, Новый ЗащищенноеСоединениеOpenSSL);
	Попытка
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
		ЕстьОтвет = Ложь;
	КонецПопытки;
	
	Если ЕстьОтвет Тогда
		Если Ответ.КодСостояния = 200 Тогда
			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
				РезультатПроверки = СтрокаОтвет;
				Если СокрЛП(РезультатПроверки)="false" Тогда
					// Сообщить("Соединение не установлено");
				Иначе
					
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатПроверки);
					ЗагруженныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
					ЧтениеJSON.Закрыть();
					
					ТЗ = РаспарситьСтатусы(ЗагруженныеДанные);
					
					Для Каждого СтрСтатус Из ТЗ Цикл
						Если Найти(нрег(СтрСтатус.Статус),"закрыт")<>0 или  Найти(нрег(СтрСтатус.Статус),"выполнено")<>0 Тогда
							Нов.СтатусЗакрыто = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"отклонен")<>0 Тогда
							Нов.СтатусОтклонено = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"обработан")<>0 Тогда
							Нов.СтатусОбработано = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"работе")<>0 Тогда
							Нов.СтатусВРаботе = СтрСтатус.Ид_Статуса;
						ИначеЕсли Найти(нрег(СтрСтатус.Статус),"отправлено в ук")<>0 Тогда
							Нов.СтатусОтправленоВУК = СтрСтатус.Ид_Статуса;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;
		Иначе
			
		КонецЕсли;
	КонецЕсли;	
	Записать();
	
КонецПроцедуры

&НаСервере
Функция РаспарситьСтатусы(Данные)	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("ИД_Статуса");
	
	Для Каждого стр из Данные Цикл
		
		Нов = ТЗ.Добавить();
		
		Нов.Статус            = Стр["Name"];
		Нов.ИД_Статуса    = Стр["id"];       // ИД события по которому будем менять статус
		Нов.ИД_Статуса    = СтрЗаменить(СокрЛП(Нов.ИД_Статуса),Символы.НПП,"");
	КонецЦикла;	
	
	Возврат ТЗ;
	
	
КонецФункции

&НаСервере
Процедура ЗапуститьСинхронизациюНаСервере()
	
	
	НаборЗаписей = РегистрыСведений.МЛК_АдресаЛичныхКабинетов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Записать();

	
	ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПервичнаяСинхронизация");
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСинхронизацию(Команда)
	ЗапуститьСинхронизациюНаСервере();
	ПоказатьОповещениеПользователя("Синхронизация",,"Запущена первичная синхронизация с МЛК",БиблиотекаКартинок.Информация32);
КонецПроцедуры

&НаКлиенте
Процедура Декорация13ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Декорация13ОбработкаНавигационнойСсылкиНаСервере();
	ЗапуститьПриложение("www.moe-zkx.ru/bit/zapusk");
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеДанныеВМЛКНаСервере()
	
	Объект.ПервичнаяСинхронизацияВыполнена           = Ложь;
	Объект.ДатаПервичнойСинхронизации                = "";
	Объект.ДатаПоследнейВыгрузкиПоНачислениям        = "";
	Объект.ДатаПоследнейВыгрузкиПоОплатам            = "";
	Объект.ДатаПоследнейСинхронизацииПоЛицевымСчетам = "";
	Объект.ДатаПоследнейСинхронизацииПоСчетчикам     = "";
	Попытка
		Записать();
	Исключение
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.МЛК_АдресаЛичныхКабинетов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Записать();
	
	ФоновыеЗадания.Выполнить("МЛК_Общий.МЛК_ПервичнаяСинхронизация");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеДанныеВМЛК(Команда)
	
	//Состояние("Не закрывайте 1с как минимум 2 часа");
	ОбновитьВсеДанныеВМЛКНаСервере();
	Обработчик = Новый ОписаниеОповещения("ПерезапуститьПрограмму", ЭтотОбъект);
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Перезапустить", НСтр("ru = 'Перезапустить'"));
	Кнопки.Добавить("НеПерезапускать", НСтр("ru = 'Не перезапускать'"));
	ТекстВопроса = НСтр("ru = 'Для применения изменений требуется перезапустить программу.'");
	ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылку(Команда)
	ЗапуститьПриложение("https://www.moe-zkx.ru/bit/docs");
КонецПроцедуры

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // ////////////////////////////
